cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

brew "gitmoji"
brew "starship"

# Paid Applications
cask "1password"
cask "affinity-designer"
cask "affinity-photo"
cask "affinity-publisher"
cask "backblaze"
cask "bartender"
cask "cleanmymac"
cask "cleanshot"
cask "hazel"
cask "nova"
cask "one-switch"
cask "sizzy"

# Free Applications
cask "alfred"
cask "airtable"
cask "amethyst"
cask "authy"
cask "bitwarden"
cask "discord"
cask "figma"
cask "firefox"
cask "github"
cask "google-chrome"
cask "grammarly"
cask "imageoptim"
cask "notion"
cask "obs"
cask "obsidian"
cask "sf-symbols"
cask "signal"
cask "slack"
cask "syncthing"
cask "twitch"
cask "visual-studio-code"
