cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# System Applications
brew "gitmoji"
brew "starship"

# Paid Applications
cask "1password"
cask "adobe-creative-cloud"
cask "backblaze"
cask "bartender"
cask "bettertouchtool"
cask "cleanmymac"
cask "cleanshot"
cask "dropbox"
cask "istat-menus"
cask "hazel"
cask "nova"
cask "polypane"
cask "rectangle-pro"
cask "spotify"

# Free Applications
cask "ableton-live-lite"
cask "authy"
cask "bitwarden"
cask "discord"
cask "figma"
cask "firefox"
cask "github"
cask "google-chrome"
cask "lastfm"
cask "imageoptim"
cask "notion"
cask "obs"
cask "sf-symbols"
cask "signal"
cask "slack"
cask "twitch"
cask "visual-studio-code"
