cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

brew "gitmoji"
brew "starship"

# Paid Applications
cask "1password"
cask "alfred"
cask "bartender"
cask "cleanmymac"
cask "airtable"
cask "authy"
cask "bitwarden"
cask "cleanshot"
cask "one-switch"
cask "sizzy"
cask "sublime-merge"
cask "sublime-text"

# Free Applications
cask "amethyst"
cask "figma"
cask "firefox"
cask "github"
cask "google-chrome"
cask "grammarly"
cask "hyper"
cask "imageoptim"
cask "notion"
cask "obsidian"
cask "sf-symbols"
cask "slack"
cask "visual-studio-code"
